# Студент решил вспомнить старые времена.
# В свое время было модно писать сообщения с чередующимися заглавной и
# малой буквами. Он захотел изобрести функцию, которая будет делать с
# любой предоставленной строкой аналогичное. Первая буква малая, следующая
# Заглавная и так далее чередуется по всей строке.
# Ваша задача: создать такую функцию, с учетом того, что пробелы и
# препинания не должны влиять на чередование регистра символов (они в
# этом процессе не учитываются, но возвращаются в итоговой строке).

phrase = str(input("Write something here: "))
print(phrase)