// Создать класс Atm - банкомат.
// В данном классе определить поля, описывающие число купюр разного номинала, заг-
// руженных в банкомат.
// Определить конструктор без параметров, задающий нулевые значения полей.
// Определить методы-аксессоры на чтение для всех полей.
// Определить  метод  load, принимающий  в  качестве  аргументов число загружаемых 
// купюр каждого номинала. Метод увеличивает число купюр в банкомате.
// Определить  метод give, принимающий в качестве аргумента сумму для выдачи. Если
// сумму можно набрать, то метод уменьшает число купюр на соответствующие значения
// и возвращает true, иначе возвращает false, не меняя числа купюр.
// (5 баллов)

public class Atm {
    public static void main(String[] args) throws Exception {
        System.out.println("Hello, World!");
    }
}
