// Создать класс MyStory.
// В классе определить метод getMyStory, возвращающий  строку, содержащую описание
// вашего видения  своего будущего и  ответ на вопрос, почему программирование вам
// не понадобится.
// (1 - 10 баллов) 

public class MyStory {
    public static void main(String[] args) throws Exception {
        String name = "Анна"; 
        String unknown = "Виолетта";
        System.out.printf("Проснувшись от резкого звука, девушка подпрыгнула на своей кровати. ");
        System.out.printf("ИИ взмывал вверх и вниз над головой хозяйки, выписывая пируэты в воздухе. Заметив движение, Смарти сразу же включила режим приветствия: %n- Доброе утро, %s!", unknown);
        System.out.printf("%nЗаспанные глаза округлились, девушка покачала головой.");
        System.out.printf("%n- Смарти, Сменить имя на %s.", name);
        System.out.printf("%nИИ проиграл какую-то бойкую мелодию, пока обновлял информацию, чтобы сделать процесс настройки более увлекательным для пользователя. Однако хозяйка уже давно стояла босиком на кухне, корчась от холода.");
        System.out.printf("%n- Смарти... Почему в холодильнике совсем не те продукты по предпочтениям?");
        System.out.printf("%n- Последнее обновление продуктов по предпочтениям: 12.01.2036 в 01:23");
        System.out.printf("%n%s заметно напряглась.%n- Назови имя пользователя, который обновил систему.", name);
        System.out.printf("%n- marrpy. %nУ девушки прошли мурашки по коже. ИИ бот нового поколения обещал быть самым надежным и защищенными от злоумышленников. %s, как уважаемый хирург отделения травматологии и ортопедии, зарабатывала достаточно, чтобы позволить себе такие дорогие технологические прихоти.", name);
        System.out.printf("%n- Пользователь marrpy оставил Вам аудиосообщение, прослушать?");
        System.out.printf("%nНемые вопросы застыли в воздухе. Все же взломали? Сколько они успели украсть данных? Или же открыв аудиофайл они получат доступ ко всему? Губы девушки дрогнули, соглашаясь с предложением на свой страх и риск, сердце невольно сжалось. ");
        System.out.printf("%nЗапись включилась. Знакомый голос из динамика смутил девушку на доли секунды... Кому он принадлежит? Внезапное осознание происходящего заставило её облокотиться на кухонный стол.");
        System.out.printf("%n- Анна, я тебе не враг, однако я совсем не знаю, как тебе это сказать. Поэтому начну с самого начала. Мой путь начался также, как и твой, - с медицинского колледжа. Однако суть параллелей в том, что одно небольшое изменение меняет всю жизнь человека. Именно это и произошло с нашими судьбами. ");
        System.out.printf("В отличие от тебя, я выбрала совершенно другой путь, сменив белый халат и вечные заучивания манипуляций, медикаментов на то, что в этой реальности меня больше всего тянет - а именно технические специальности. ");
        System.out.printf("Я не могу рассказать тебе, как именно я связалась с тобой и что происходит в нашем мире, потому что последствия этих действий еще неизвестны ученым. Мы не рискуем. Однако, мне хотелось рассказать тебе, что существует другой мир, другая ты. Показать тебе, на что способна наука, если её правильно использовать. ");
        System.out.printf("Я знаю, что ты поймешь меня, потому что ты - это я. Я немного внесла изменений в твой рацион питания. В нашей Вселенной мы развили диетологию на новый уровень, поэтому тебе как медику будет интересно разгадать, почему я выбрала для тебя именно эти продукты. Приятно было узнать тебя, %s! Кто знает, может, мы еще увидимся? ", name);
        System.out.printf("%nДевушка села на кровать, переосмысливая услышанное.");
        System.out.printf("%n- Аудиосообщение прослушано. Хорошего дня, %s!", name);
        System.out.printf("%nАнна начала рассматривать множество вариантов: шутка ли это? Возможно ли, что и в этой реальности её влекло к технике? Она вспомнила свои годы в колледже, когда она с удовольствием разбиралась в системе ЕМИАСА. Неужели и правда вторая она - существует? И ведь действительно, её хотели назвать Виолеттой, но что-то сподвигло родителей изменить выбор. ");
        System.out.printf("Получается... Это правда? По привычке, от тревоги, девушка растирала ладони.");
        System.out.printf("%nВместе с этим она представляла, что где-то в другой, совершенно незнакомой ей реальности существует еще одна она, внимательно рассматривает себя, но другую, через объектив Смарти, как давно потерянное полотно великого художника, скурпулёзно изучая каждую деталь творения.");
    }
}
